In [6]:
import pandas as pd
path = "Resources/test.csv"

In [7]:
test_df = pd.read_csv(path)
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [8]:
test_df.drop(labels=["PassengerId", "Name", "Ticket", "Cabin"], axis=1, inplace=True)
test_df.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [11]:
test_df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [10]:
test_df.dropna(axis=0, how='any', inplace=True)

In [17]:
counter = 0;
encoded_sex_list = []
for sex in test_df["Sex"]:
    if sex == "male":
        encoded_sex_list.append(0);
    elif sex == "female":
        encoded_sex_list.append(1);
    else:
        encoded_sex_list.append(2);
        counter = counter+1;
print(counter)

0

In [20]:
counter = 0;
encoded_embarked_list = []
for embark in test_df["Embarked"]:
    if embark == "Q":
        encoded_embarked_list.append(0);
    elif embark == "S":
        encoded_embarked_list.append(1);
    elif embark == "C":
        encoded_embarked_list.append(2);
    else:
        encoded_embarked_list.append(3);
        counter = counter+1;
print(counter)

0

In [23]:
test_dict = {
    "Pclass": test_df["Pclass"],
    "Sex": encoded_sex_list,
    "Age": test_df["Age"],
    "SibSp": test_df["SibSp"],
    "Parch": test_df["Parch"],
    "Fare": test_df["Fare"],
    "Embarked": encoded_embarked_list
}
columns=["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]

In [24]:
cleaned_test_df = pd.DataFrame(test_dict, columns=columns)
cleaned_test_df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    0  34.5      0      0   7.8292         0
1       3    1  47.0      1      0   7.0000         1
2       2    0  62.0      0      0   9.6875         0
3       3    0  27.0      0      0   8.6625         1
4       3    1  22.0      1      1  12.2875         1

In [25]:
cleaned_test_df.to_csv("cleaned_test.csv", index=False)